# Import csv

In [2]:
import pandas as pd

In [3]:
attacks = pd.read_csv("../data/attacks.csv", encoding="unicode_escape")

# Explore table

In [4]:
attacks.sample()

,Case Number,Date,Year,Type,Country,Area,Location,Activity,Name,Sex,...,Species,Investigator or Source,pdf,href formula,href,Case Number.1,Case Number.2,original order,Unnamed: 22,Unnamed: 23
14041,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,...,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN

In [5]:
attacks.shape

(25723, 24)

In [6]:
attacks.columns

Index(['Case Number', 'Date', 'Year', 'Type', 'Country', 'Area', 'Location',
       'Activity', 'Name', 'Sex ', 'Age', 'Injury', 'Fatal (Y/N)', 'Time',
       'Species ', 'Investigator or Source', 'pdf', 'href formula', 'href',
       'Case Number.1', 'Case Number.2', 'original order', 'Unnamed: 22',
       'Unnamed: 23'],
      dtype='object')

In [8]:
attacks.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 25723 entries, 0 to 25722
Data columns (total 24 columns):
 #   Column                  Non-Null Count  Dtype
---  ------                  --------------  -----
 0   Case Number             8702 non-null   object
 1   Date                    6302 non-null   object
 2   Year                    6300 non-null   float64
 3   Type                    6298 non-null   object
 4   Country                 6252 non-null   object
 5   Area                    5847 non-null   object
 6   Location                5762 non-null   object
 7   Activity                5758 non-null   object
 8   Name                    6092 non-null   object
 9   Sex                     5737 non-null   object
 10  Age                     3471 non-null   object
 11  Injury                  6274 non-null   object
 12  Fatal (Y/N)             5763 non-null   object
 13  Time                    2948 non-null   object
 14  Species                 3464 non-null   object
 15  Investigator or Source  6285 non-null   object
 16  pdf                     6302 non-null   object
 17  href formula            6301 non-null   object
 18  href                    6302 non-null   object
 19  Case Number.1           6302 non-null   object
 20  Case Number.2           6302 non-null   object
 21  original order          6309 non-null   float64
 22  Unnamed: 22             1 non-null      object
 23  Unnamed: 23             2 non-null      object
dtypes: float64(2), object(22)
memory usage: 4.7+ MB

# Explore cohesiveness of data

In [75]:
attacks.duplicated()

0        False
1        False
2        False
3        False
4        False
         ...
25718     True
25719     True
25720     True
25721     True
25722    False
Length: 25723, dtype: bool

In [50]:
attacks.duplicated().sum()

19411

In [77]:
attacks.isna().sum()

Case Number               17021
Date                      19421
Year                      19423
Type                      19425
Country                   19471
Area                      19876
Location                  19961
Activity                  19965
Name                      19631
Sex                       19986
Age                       22252
Injury                    19449
Fatal (Y/N)               19960
Time                      22775
Species                   22259
Investigator or Source    19438
pdf                       19421
href formula              19422
href                      19421
Case Number.1             19421
Case Number.2             19421
original order            19414
Unnamed: 22               25722
Unnamed: 23               25721
dtype: int64

# Explore data

In [52]:
attacks.dtypes #Only year and order as numbers

Case Number                object
Date                       object
Year                      float64
Type                       object
Country                    object
Area                       object
Location                   object
Activity                   object
Name                       object
Sex                        object
Age                        object
Injury                     object
Fatal (Y/N)                object
Time                       object
Species                    object
Investigator or Source     object
pdf                        object
href formula               object
href                       object
Case Number.1              object
Case Number.2              object
original order            float64
Unnamed: 22                object
Unnamed: 23                object
dtype: object

In [53]:
attacks.describe()

              Year  original order
count  6300.000000     6309.000000
mean   1927.272381     3155.999683
std     281.116308     1821.396206
min       0.000000        2.000000
25%    1942.000000     1579.000000
50%    1977.000000     3156.000000
75%    2005.000000     4733.000000
max    2018.000000     6310.000000

## Relevant variables

### Type of attack:

In [85]:
pd.DataFrame(attacks["Type"].value_counts())

              count
Type
Unprovoked     4595
Provoked        574
Invalid         547
Sea Disaster    239
Boating         203
Boat            137
Questionable      2
Boatomg           1

In [95]:
pd.DataFrame(attacks["Activity"].value_counts()).sample(5)

                                count
Activity
Playing in the water                2
Spearfishing on Scuba               6
Fishing, hauling in a set line      1
Fishing for snapper                 3
Floating face down                  1

In [89]:
pd.DataFrame(attacks["Fatal (Y/N)"].value_counts())

             count
Fatal (Y/N)
N             4293
Y             1388
UNKNOWN         71
 N               7
M                1
2017             1
N                1
y                1

In [147]:
# pd.DataFrame(attacks["Injury"].value_counts()).sample(5)
    # "Said to have been killed by sorcerers that turned themselves into sharks.
    #  The alleged sorcerers were taken into custody by authorities but released due to lack of evidence."

### Place

In [100]:
pd.DataFrame(attacks["Country"].value_counts()).sample(5) #West indies, Between Portugal & India, Roatan

                  count
Country
ATLANTIC OCEAN       17
OKINAWA               6
COMOROS               1
PAPUA NEW GUINEA    134
BANGLADESH            1

In [102]:
#attacks["Area"].value_counts()

In [83]:
#attacks["Location"].value_counts()

### Individuals

In [91]:
pd.DataFrame(attacks["Sex "].value_counts())

      count
Sex
M      5094
F       637
M         2
N         2
lli       1
.         1

In [137]:
pd.DataFrame(attacks["Age"].value_counts()).sample(5)

      count
Age
6Â½        1
60's      1
45       32
 30       1
7        22

In [79]:
#attacks["Name"].value_counts()

### Time variables:

In [108]:
pd.DataFrame(attacks["Date"].value_counts()).sample(5)

             count
Date
25-Jul-1998      1
20-Aug-2008      1
08-Nov-1911      1
1890             1
Jul-1987         1

In [131]:
pd.DataFrame(attacks["Year"].value_counts()).sample(5) #Year 5, year 1595...

        count
Year
1972.0     35
1873.0      4
1595.0      1
1895.0     20
1924.0     19

In [92]:
pd.DataFrame(attacks["Time"].value_counts())

             count
Time
Afternoon      187
11h00          128
Morning        121
12h00          109
15h00          108
...            ...
14h37            1
10h07            1
13h53            1
13h23            1
19h00-20h00      1

[366 rows x 1 columns]

### Sharks:

In [93]:
pd.DataFrame(attacks["Species "].value_counts())

                                                    count
Species
White shark                                           163
Shark involvement prior to death was not confirmed    105
Invalid                                               102
Shark involvement not confirmed                        88
Tiger shark                                            73
...                                                   ...
1.2 m to 1.5 m [4.5' to 5'] shark                       1
Bull shark, 2.3 m [7.5']                                1
0.9 m  [3'] shark                                       1
Mako shark, 14'                                         1
Said to involve a grey nurse shark that leapt o...      1

[1549 rows x 1 columns]

### Other variables:

In [84]:
# attacks["Investigator or Source"].value_counts()
# attacks["pdf"].value_counts()
# attacks["href formula"].value_counts()
# attacks["href"].value_counts()
# attacks["Case Number.1"].value_counts()
# attacks["Case Number.2"].value_counts()
# attacks["original order"].value_counts()
# attacks["Unnamed: 22"].value_counts()
# attacks["Unnamed: 23"].value_counts()

# Research questions

- Shark related attacks according to sex.
    - Shark related attacks according to sex, throughout history

- Shark related deaths according to sex.
    - Shark related deaths according to sex, throughout history

- PIRATE KIDS:
    - Shark related infant deaths according to sex throughout history

- Morning bird-shark: What is a shark's favourite meal?